{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "name": "input", "input_dtype": "int32"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embeddings", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": true, "input_dim": 42, "batch_input_shape": [null, 21], "W_regularizer": null, "dropout": 0.0, "output_dim": 2, "input_length": 21}, "inbound_nodes": [[["input", 0, 0]]], "name": "embeddings"}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "recurrent_layer", "go_backwards": false, "output_dim": 20, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 2, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["embeddings", 0, 0]]], "name": "recurrent_layer"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "comparison", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10}, "inbound_nodes": [[["recurrent_layer", 0, 0]]], "name": "comparison"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "output", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["comparison", 0, 0]]], "name": "output"}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}}