{"loss": "dict", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.3", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "name": "input1", "input_dtype": "int32"}, "inbound_nodes": [], "name": "input1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "name": "input2", "input_dtype": "int32"}, "inbound_nodes": [], "name": "input2"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embeddings", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": true, "input_dim": 26, "batch_input_shape": [null, 21], "W_regularizer": null, "dropout": 0.0, "output_dim": 2, "input_length": 21}, "inbound_nodes": [[["input1", 0, 0]], [["input2", 0, 0]]], "name": "embeddings"}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "recurrent_layer", "go_backwards": false, "output_dim": 15, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 2, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["embeddings", 0, 0]], [["embeddings", 1, 0]]], "name": "recurrent_layer"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["recurrent_layer", 0, 0], ["recurrent_layer", 1, 0]]], "name": "merge_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "output", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 3}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "output"}], "input_layers": [["input1", 0, 0], ["input2", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}