{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "name": "input", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "hidden", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 6}, "inbound_nodes": [[["input", 0, 0]]], "name": "hidden"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "output", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["hidden", 0, 0]]], "name": "output"}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}}