{"class_name": "Model", "keras_version": "1.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 57], "name": "input", "input_dtype": "int32"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Embedding", "config": {"trainable": false, "name": "embeddings", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": true, "input_dim": 26, "batch_input_shape": [null, 57], "W_regularizer": null, "dropout": 0.0, "output_dim": 2, "input_length": 57}, "inbound_nodes": [[["input", 0, 0]]], "name": "embeddings"}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "recurrent_layer", "go_backwards": false, "output_dim": 15, "trainable": false, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 2, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["embeddings", 0, 0]]], "name": "recurrent_layer"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}}, "trainable": true, "name": "grammatical"}, "inbound_nodes": [[["recurrent_layer", 0, 0]]], "name": "grammatical"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, "trainable": true, "name": "intermediate_locally"}, "inbound_nodes": [[["recurrent_layer", 0, 0]]], "name": "intermediate_locally"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, "trainable": true, "name": "intermediate_recursively"}, "inbound_nodes": [[["recurrent_layer", 0, 0]]], "name": "intermediate_recursively"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}}, "trainable": true, "name": "subtracting"}, "inbound_nodes": [[["recurrent_layer", 0, 0]]], "name": "subtracting"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, "trainable": true, "name": "top_stack"}, "inbound_nodes": [[["recurrent_layer", 0, 0]]], "name": "top_stack"}], "input_layers": [["input", 0, 0]], "output_layers": [["grammatical", 0, 0], ["intermediate_locally", 0, 0], ["intermediate_recursively", 0, 0], ["subtracting", 0, 0], ["top_stack", 0, 0]], "name": "model_1"}}