{"loss": {"output": "mean_squared_error"}, "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 25], "name": "input", "input_dtype": "int32"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embeddings", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": true, "input_dim": 26, "batch_input_shape": [null, 25], "W_regularizer": null, "dropout": 0.0, "output_dim": 2, "input_length": 25}, "inbound_nodes": [[["input", 0, 0]]], "name": "embeddings"}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "recurrent_layer", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 15, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 2, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}, "inbound_nodes": [[["embeddings", 0, 0]]], "name": "recurrent_layer"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "output", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["recurrent_layer", 0, 0]]], "name": "output"}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}